Norminal Encoding

In [10]:
import pandas as pd

from sklearn.preprocessing import OneHotEncoder
 
df = pd.DataFrame({
    "color": ["red", "blue", "green", "blue", "red"],
    "size": ["S", "M", "L", "M", "S"],
    "price": [10, 20, 30, 20, 10]
})


encoder = OneHotEncoder()

encoded = encoder.fit_transform(df[["color"]]).toarray()

In [14]:
encoded_df = pd.DataFrame(encoded, columns=encoder.get_feature_names_out())

encoded_df

df = pd.concat([df, encoded_df], axis=1)
df

   color size  price  color_blue  color_green  color_red
0    red    S     10         0.0          0.0        1.0
1   blue    M     20         1.0          0.0        0.0
2  green    L     30         0.0          1.0        0.0
3   blue    M     20         1.0          0.0        0.0
4    red    S     10         0.0          0.0        1.0

Label Encoding

In [17]:
df = pd.DataFrame({
    "color": ["red", "blue", "green", "blue", "red"],
    "size": ["S", "M", "L", "M", "S"],
    "price": [10, 20, 30, 20, 10]
})
df

   color size  price
0    red    S     10
1   blue    M     20
2  green    L     30
3   blue    M     20
4    red    S     10

In [25]:
from sklearn.preprocessing import LabelEncoder

lbl_encoder = LabelEncoder()
lbl_encoded = lbl_encoder.fit_transform(df['color'])

In [31]:
lbl_df = pd.DataFrame(lbl_encoded, columns=["color_encoded"])
lbl_df = pd.concat([df, lbl_df], axis=1)
lbl_df

   color size  price  color_encoded
0    red    S     10              2
1   blue    M     20              0
2  green    L     30              1
3   blue    M     20              0
4    red    S     10              2

Ordinal Encoding

In [ ]:
df = pd.DataFrame({
    "size": ["S", "M", "L", "M", "S"],
})

from sklearn.preprocessing import OrdinalEncoder

oe = OrdinalEncoder(categories=[['S', 'M', 'L']])



oe_df = pd.DataFrame(oe.fit_transform(df), columns=df.columns)

df = pd.concat([df, oe_df], axis=1)
df

   size  size
0     S   0.0
1     M   1.0
2     L   2.0
3     M   1.0
4     S   0.0

Target Guided Ordinal Encoding

In [40]:

df = pd.DataFrame({
    "city": ["New York", "Los Angeles", "New York", "Los Angeles", "New York"],
    "price": [10, 20, 30, 20, 10]
})
df

          city  price
0     New York     10
1  Los Angeles     20
2     New York     30
3  Los Angeles     20
4     New York     10

In [43]:
mean_city_price = df.groupby("city")["price"].mean().to_dict()
mean_city_price

{'Los Angeles': 20.0, 'New York': 16.666666666666668}

In [44]:
df["city_encoded"] = df["city"].map(mean_city_price)
df

          city  price  city_encoded
0     New York     10     16.666667
1  Los Angeles     20     20.000000
2     New York     30     16.666667
3  Los Angeles     20     20.000000
4     New York     10     16.666667

Pratice

In [70]:
import seaborn as sns

data = sns.load_dataset("tips")
data.head()

   total_bill   tip     sex smoker  day    time  size
0       16.99  1.01  Female     No  Sun  Dinner     2
1       10.34  1.66    Male     No  Sun  Dinner     3
2       21.01  3.50    Male     No  Sun  Dinner     3
3       23.68  3.31    Male     No  Sun  Dinner     2
4       24.59  3.61  Female     No  Sun  Dinner     4

In [71]:
encoding_dict = data.groupby("time")["total_bill"].mean().to_dict()
encoding_dict

C:\Users\MSI\AppData\Local\Temp\ipykernel_16116\1699131147.py:1: FutureWarning: The default of observed=False is deprecated and will be changed to True in a future version of pandas. Pass observed=False to retain current behavior or observed=True to adopt the future default and silence this warning.
  encoding_dict = data.groupby("time")["total_bill"].mean().to_dict()

{'Lunch': 17.168676470588235, 'Dinner': 20.79715909090909}

In [72]:
data["time"] = data["time"].map(encoding_dict)

data

     total_bill   tip     sex smoker   day       time  size
0         16.99  1.01  Female     No   Sun  20.797159     2
1         10.34  1.66    Male     No   Sun  20.797159     3
2         21.01  3.50    Male     No   Sun  20.797159     3
3         23.68  3.31    Male     No   Sun  20.797159     2
4         24.59  3.61  Female     No   Sun  20.797159     4
..          ...   ...     ...    ...   ...        ...   ...
239       29.03  5.92    Male     No   Sat  20.797159     3
240       27.18  2.00  Female    Yes   Sat  20.797159     2
241       22.67  2.00    Male    Yes   Sat  20.797159     2
242       17.82  1.75    Male     No   Sat  20.797159     2
243       18.78  3.00  Female     No  Thur  20.797159     2

[244 rows x 7 columns]